Revit 2024 API
Wave.WaveDistribution Property
 The property labeled "Distribution" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WaveDistribution { get; }
Visual Basic
Public Shared ReadOnly Property WaveDistribution As String
	Get
Visual C++
public:
static property String^ WaveDistribution {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WaveDistributionType".
See Also
Wave Class
Autodesk.Revit.DB.Visual Namespace